## Plan Result (Network_sbox - DeployInfrastructure)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.network.azurerm_subnet.additional_subnets[&#34;infra-appgws&#34;]
* Update
  * module.network.azurerm_virtual_network.virtual_network




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.azurerm_subnet.additional_subnets["infra-appgws"] will be created
  + resource "azurerm_subnet" "additional_subnets" {
      + address_prefixes                               = [
          + "10.2.16.0/25",
        ]
      + enforce_private_link_endpoint_network_policies = true
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "infra-appgws"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cft-sbox-network-rg"
      + virtual_network_name                           = "cft-sbox-vnet"
    }

  # module.network.azurerm_virtual_network.virtual_network will be updated in-place
  ~ resource "azurerm_virtual_network" "virtual_network" {
      ~ address_space           = [
          ~ "10.2.8.0/21" -> "10.2.0.0/19",
        ]
        id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet"
        name                    = "cft-sbox-vnet"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":693,"Program":"tfcmt","SHA1":"","Target":"Network_sbox - DeployInfrastructure","Vars":{}} -->